import React, { Component } from 'react';
import Article from "../Article";

class Newsfeed extends Component {
    constructor() {
        super();

        this.state = {
            newsToRender: 2,
            newsfeed: [
                {
                    id: 1,
                    title: "Парламент Британії проголосував за поправку про відтермінування Brexit",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 16:53",
                    text: "Палата громад британського парламенту проголосувала за поправку, яка передбачає, що Brexit буде відстрочений навіть в тому випадку, якщо пізніше законодавці затвердять проєкт угоди про вихід з ЄС.\n" +
                        "\n" +
                        "Про це повідомляє \"Європейська правда\".\n" +
                        "\n" +
                        "Поправку підтримали 322 депутати, проти проголосували 306 законодавців."
                },
                {
                    id: 2,
                    title: "Microsoft оголосила про “кінець життя” Windows 7 Pro з 2020 року",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 17:00",
                    text: "Американська компанія «Microsoft» більше не випускатиме оновлення програмного забезпечення для «Windows 7 Pro» з 14 січня 2020 року.\n" +
                        "\n" +
                        "\n" +
                        " \n" +
                        "Про це повідомляє Techradar.\n" +
                        "\n" +
                        "Користувачі незабаром отримуватимуть відповідні сповіщення з попередженням із кнопкою «Дізнатися більше». Компанія пропонуватиме їм встановити новий Windows 10.\n" +
                        "\n" +
                        "Водночас у «Microsoft» попереджують, що користувачів, які залишаться на старій платформі, можуть атакувати хакери.\n" +
                        "\n" +
                        "Зазначається, що користувачі Windows 7 HOME вже почали бачити сповіщення від розробника."
                },
                {
                    id: 3,
                    title: "Samsung прекращает поддержку Linux на Dex",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 18:00",
                    text: "Полнофункциональная производительность настольного компьютера на подключенном мобильном устройстве уже несколько лет является своего рода святым Граалем. Конечно же, в правильных и технически подкованных сообществах. И хотя у крупных игроков на рынке смартфонов сегодня есть различные интерфейсы и рабочие процессы для настольных компьютеров, Samsung был одним из немногих, кто воплотил в жизнь свою мечту в своей полной бескомпромиссности с программой Linux on Dex."
                },
                {
                    id: 4,
                    title: "Нова стратегія Xiaomi: виробник бере курс на подорожчання продукції",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 19:00",
                    text: "Китайська компанія Xiaomi добре відома своїми бюджетними ґаджетами. На індійському ринку виробник є беззаперечним лідером у цій сфері. Однак компанія вирішила позбутися іміджу «дешевого» бренду. В тому числі в Індії.\n" +
                        "\n" +
                        "Як пише Gizmochina, зараз Xiaomi планує додати у лінійку дорожчі смартфони і розумні телевізори.\n" +
                        "\n" +
                        "До теми: Велика презентація продуктів Xiaomi у Києві: як це було  Велика презентація продуктів Xiaomi у Києві: як це було\n" +
                        "\n" +
                        "При цьому бюджетники буде випускати бренд компанії – Redmi. За задумом виробника, саме цей бренд має займати нішу, яку наразі займає уся компанія Xiaomi.\n" +
                        "\n" +
                        "Чого чекати користувачам? З такої стратегії можна припустити, що продукція Xiaomi буде дорожчати. При цьому можна очікувати, що нові девайси будуть мати дорожчу комплектацію.\n" +
                        "\n" +
                        "Йдеться перш за все про індійський ринок, адже для цієї країни виробник часто представляв ексклюзивні дешеві пристрої. Вартість найпопулярніших смартфонів на цьому ринку не перевищують 250 доларів (6 200 гривень).\n"
                },
                {
                    id: 5,
                    title: "Индикатор батареи на телефоне стал новым способом измерять время",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 20:00",
                    text: "Исследователи из Бизнес-школы имени Джона Касса обнаружили, что индикатор заряда аккумулятора в интерфейсе смартфонов повлиял на то, как люди стали воспринимать время и пространство.\n" +
                        "\n" +
                        "Авторы исследования опросили пользователей и выяснили, что многие из них измеряют, например, длительность поездки на автомобилях не в часах или километрах, а в том, на сколько хватит аккумулятора до следующего пункта, где его можно будет подзарядить. По сути, люди в планировании остановок отталкиваются от автономности своего гаджета."
                },
                {
                    id: 6,
                    title: "GOOGLE ДОДАСТЬ МІТКИ З ПОПОРЕДЖЕННЯМИ В GOOGLE MAPS ДЛЯ IOS",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 21:00",
                    text: "Останнім часом, а саме починаючи з 2018 року, корпорація Google стала вкрай активно займатися розвитком, вдосконаленням і додаванням нових функцій в своє фірмове додаток Google Maps для всіх смартфонів і планшетів, що працюють на базі операційної системи Android. Серед подібних нових функцій можна виділити можливість повідомлення з довідника про те, що десь утворилася пробка, є утруднення в русі, якась дорога перекрита, в ній виявлена ​​яма і багато іншого. Так, це безумовно дуже корисна функція, якою користуються автолюбителі по всьому світу."
                },
                {
                    id: 7,
                    title: "Астрономы пронаблюдали гибель планет земного типа",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 22:00",
                    text: "Команда астрономов под руководством Бенджамина Цукермана из Калифорнийского университета в Лос-Анджелесе пронаблюдала за гибелью землеподобных экзопланет. Эти наблюдения помогли исследователям выяснить состав подобных небесных тел, сообщает Naked science.\n" +
                        "\n" +
                        "Подобные на Солнце звезды в конце своей жизни сбрасывают внешние оболочки и превращаются в белых карликов. Этот процесс нарушает стабильные орбиты планет и других небесных тел. Некоторые из них начинают по спирали сближаться с карликом и распадаются под действием его гравитации за период от 100 тысяч до миллиона лет. В результате на поверхность тусклой звезды падают обломки и пыль, состав которых можно различить в спектральных данных белого карлика."
                },
                {
                    id: 8,
                    title: "До Землі стрімко наближається астероїд діаметром у кілометр",
                    date: "СУБОТА, 19 ЖОВТНЯ 2019, 23:00",
                    text: "Центр дослідження навколоземних об'єктів NASA зафіксував наближення до Землі астероїда 162082 (1998 HL1) розміром від 400 метрів до 1 км, повідомляє Depo.ua з посиланням на Укрінформ. \n" +
                        "\n" +
                        "На мінімальній відстані об'єкт пройде 25 жовтня в 20:21 за київським часом, загрози для Землі він не становить, оскільки пройде на відстані 0,04 астрономічних одиниць (16 відстаней до Місяця).\n" +
                        "\n" +
                        "Центр вивчення навколоземних об'єктів NASA спостерігає за майже 20 тис. небесних тіл, які знаходяться поблизу орбіти Землі."
                }
            ]
        }

        this.handleClick = this.handleClick.bind(this);

    }

    handleClick(e){
        this.setState({
            newsToRender:(this.state.newsToRender + e)
        });
    }

    render() {
        return (
            <>
                {this.state.newsfeed.slice(0, this.state.newsToRender).map(news => {
                    return (
                            <Article
                                key={news.id}
                                title={news.title}
                                date={news.date}
                                text={news.text}
                            />
                    );
                })}

                <button
                    onClick={() => this.handleClick(2)}
                >
                    Show More
                </button>
                </>
        );
    }
}
export default Newsfeed;